{
    "recipes": [
    {
    "name": "Gulyás (Hungarian Goulash)",
    "ingredients": [
    "2 tablespoons vegetable oil",
    "2 medium onions, chopped",
    "2 teaspoons Hungarian sweet paprika",
    "1/4 teaspoon caraway seeds",
    "1 1/2 pounds beef chuck, cut into 1-inch cubes",
    "1/2 teaspoon salt",
    "1/4 teaspoon ground black pepper",
    "2 cloves garlic, minced",
    "1 cup beef broth",
    "1 cup diced tomatoes",
    "2 carrots, peeled and sliced",
    "2 medium potatoes, peeled and cubed",
    "1 green bell pepper, seeded and chopped",
    "1/4 cup chopped fresh parsley"
    ],
    "instructions": [
    "In a large pot or Dutch oven, heat the vegetable oil over medium heat. Add the onions and cook until soft and translucent, about 5 minutes.",
    "Add the paprika, caraway seeds, beef, salt, and black pepper to the pot, stirring to coat the beef evenly with the spices.",
    "Add the garlic and cook for an additional 2 minutes.",
    "Pour in the beef broth and diced tomatoes, and bring the mixture to a boil. Reduce the heat to low, cover, and simmer for 1 hour.",
    "Add the carrots, potatoes, and green bell pepper to the pot. Continue to simmer, covered, for another 30-40 minutes, or until the vegetables are tender.",
    "Remove the pot from the heat and stir in the fresh parsley. Adjust the seasoning with salt and pepper, if necessary. Serve the goulash hot, accompanied by crusty bread or Hungarian-style noodles."
    ]
    },
    {
    "name": "Lángos (Hungarian Fried Bread)",
    "ingredients": [
    "1 1/2 cups warm water",
    "1 teaspoon sugar",
    "1 package active dry yeast (2 1/4 teaspoons)",
    "4 cups all-purpose flour",
    "1 teaspoon salt",
    "1/4 cup vegetable oil, plus more for frying",
    "Optional toppings: sour cream, grated cheese, minced garlic, salt, or powdered sugar"
    ],
    "instructions": [
    "In a small bowl, combine the warm water, sugar, and yeast. Stir and let it sit for 5-10 minutes, or until frothy.",
    "In a large bowl, mix together the flour and salt. Add the yeast mixture and 1/4 cup vegetable oil. Mix until a soft dough forms.",
    "Knead the dough on a lightly floured surface for about 10 minutes, or until smooth and elastic. Place the dough in a greased bowl, cover with a damp cloth, and let it rise in a warm place for 1-1.5 hours, or until doubled in size.",
    "Divide the risen dough into 10-12 equal pieces. Roll out each piece into a thin circle, about 1/8-inch thick.",
    "Heat about 1-inch of vegetable oil in a large skillet or frying pan over medium-high heat. Fry the dough circles one at a time, until golden brown on both sides, about 2-3 minutes per side. Use a slotted spoon or tongs to remove the lángos from the oil and transfer to a paper towel-lined plate to drain.",
    "Serve the lángos warm, with your choice of toppings, such as sour cream, grated cheese, minced garlic, salt, or powdered sugar."
    ]
    },
    {
    "name": "Túrós Csusza (Hungarian Cheese Noodles)",
    "ingredients": [
    "8 ounces dry egg noodles",
    "2 tablespoons unsalted butter",
    "1 cup farmer's cheese (or cottage cheese)",
    "1/2 cup sour cream",
    "1/2 teaspoon salt",
    "1/4 teaspoon ground black pepper",
    "4 slices bacon, chopped",
    "Optional: 1/4 cup chopped fresh chives or parsley"
    ],
    "instructions": [
    "Bring a large pot of salted water to a boil. Cook the egg noodles according to the package instructions until al dente. Drain and set aside.",
    "While the noodles are cooking, heat a skillet over medium heat. Add the chopped bacon and cook until crispy. Remove the bacon from the skillet and place it on a paper towel-lined plate to drain. Set aside.",
    "In a large bowl, mix together the farmer's cheese (or cottage cheese) and sour cream. Season with salt and black pepper.",
    "Add the cooked noodles to the cheese mixture, stirring gently to combine. Melt the butter in the skillet used for the bacon, then add the noodle and cheese mixture. Cook over low heat, stirring occasionally, for about 5 minutes, or until heated through.",
    "Serve the túrós csusza hot, topped with the crispy bacon and optional chopped fresh chives or parsley."
    ]
    },
    {
    "name": "Kürtőskalács (Hungarian Chimney Cake)",
    "ingredients": [
    "1/2 cup warm milk",
    "1 teaspoon sugar",
    "1 package active dry yeast (2 1/4 teaspoons)",
    "4 cups all-purpose flour",
    "1/2 cup sugar",
    "1/4 teaspoon salt",
    "1 large egg",
    "2 large egg yolks",
    "1/4 cup unsalted butter, melted",
    "1 teaspoon vanilla extract",
    "1/4 cup unsalted butter, melted (for brushing)",
    "1 cup granulated sugar (for coating)",
    "Optional: 2 teaspoons ground cinnamon, cocoa powder, or finely ground nuts"
    ],
    "instructions": [
    "In a small bowl, combine the warm milk, 1 teaspoon sugar, and yeast. Stir and let it sit for 5-10 minutes, or until frothy.",
    "In a large bowl, mix together the flour, 1/2 cup sugar, and salt. Add the yeast mixture, egg, egg yolks, 1/4 cup melted butter, and vanilla extract. Mix until a soft dough forms.",
    "Knead the dough on a lightly floured surface for about 10 minutes, or until smooth and elastic. Place the dough in a greased bowl, cover with a damp cloth, and let it rise in a warm place for 1-1.5 hours, or until doubled in size.",
    "Preheat your oven to 375°F (190°C). Set up the chimney cake molds or thick wooden dowels (wrapped in aluminum foil) on a baking sheet.",
    "Divide the risen dough into 6 equal pieces. Roll out each piece into a long, thin rope (about 24 inches long). Starting at the bottom of the mold, wrap the dough rope around the mold, slightly overlapping each layer.",
    "Brush the kürtőskalács with the melted butter, and then roll them in the granulated sugar to coat evenly. Optionally, mix the sugar with ground cinnamon, cocoa powder, or finely ground nuts for additional flavor.",
    "Bake the kürtőskalács in the preheated oven for 20-25 minutes, or until goldenbrown and caramelized. Make sure to rotate the molds occasionally to ensure even browning.",
    "Carefully remove the kürtőskalács from the molds and let them cool on a wire rack for a few minutes. The sugar coating will become crispy as it cools.",
    "Serve the kürtőskalács warm or at room temperature. They are best enjoyed the same day they are made."
    ]
    },
    {
    "name": "Hortobágyi Palacsinta (Hungarian Stuffed Pancakes)",
    "ingredients": [
    "For the Pancakes:",
    "1 cup all-purpose flour",
    "1/2 teaspoon salt",
    "2 large eggs",
    "1 1/4 cups milk",
    "1/2 cup sparkling water",
    "1 tablespoon vegetable oil, plus more for frying",
    "For the Filling:",
    "1 tablespoon vegetable oil",
    "1 medium onion, finely chopped",
    "1 clove garlic, minced",
    "1 pound ground meat (pork, beef, or a combination)",
    "1/2 teaspoon salt",
    "1/4 teaspoon ground black pepper",
    "1/4 teaspoon Hungarian sweet paprika",
    "1/4 cup sour cream",
    "For the Sauce:",
    "1 cup sour cream",
    "1/2 cup grated cheese (Gouda or Emmental)"
    ],
    "instructions": [
    "Make the Pancakes:",
    "In a large bowl, whisk together the flour and salt. Add the eggs, milk, sparkling water, and 1 tablespoon vegetable oil. Mix until a smooth batter forms.",
    "Heat a non-stick skillet over medium heat. Add a small amount of oil, and then pour in a ladleful of batter, swirling the pan to evenly coat the bottom. Cook the pancake for 1-2 minutes, or until the edges are golden brown, and then flip it to cook the other side. Transfer the cooked pancake to a plate and repeat with the remaining batter.",
    "Make the Filling:",
    "Heat the vegetable oil in a skillet over medium heat. Add the onion and cook until soft and translucent, about 5 minutes. Add the garlic and cook for an additional 2 minutes.",
    "Add the ground meat, salt, pepper, and paprika to the skillet. Cook, breaking up the meat with a spoon, until browned and cooked through. Remove from the heat and stir in the sour cream.",
    "Assemble the Hortobágyi Palacsinta:",
    "Preheat the oven to 350°F (180°C).",
    "Place a few tablespoons of the meat filling on one side of each pancake. Roll up the pancakes to encase the filling.",
    "Place the filled pancakes seam-side down in a baking dish. In a small bowl, mix together the sour cream and grated cheese. Spread this mixture over the pancakes.",
    "Bake the Hortobágyi Palacsinta for 15-20 minutes, or until the cheese is melted and the pancakes are heated through. Serve warm."
    ]
    }
    ]
    }